[
    {
        "Name": "Address_security_issues_in_Ethereum_smart_contracts",
        "Title": "이더리움 스마트 계약의 보안 문제를 해결하기 위한 프레임워크의 설계 및 구현",
        "Experiment": "이 논문은 블록체인 기술을 기반으로 하는 분산형 애플리케이션 플랫폼인 이더리움의 핵심 기능인 스마트 계약에 관한 것입니다. 스마트 계약은 자동화된 계약 실행을 가능하게 하며 다양한 산업 분야에서 활용되고 있습니다. 하지만 스마트 계약의 보안 취약성으로 인해 다양한 보안 문제가 발생하고 있습니다. 이 논문에서는 이더리움 스마트 계약의 보안 문제를 분석하고 이를 해결하기 위한 솔루션을 제안합니다.",
        "Interestingness": 5,
        "Feasibility": 3,
        "Novelty": 3,
        "Novel": true
    },
    {
        "Name": "Implementing_a_framework_for_analyzing_smart_contract_security",
        "Title": "스마트 계약 보안 취약점 분석 및 보안 자동화를 위한 프레임워크 구현",
        "Experiment": "본 논문에서는 블록체인 기술을 기반으로 한 분산형 애플리케이션 플랫폼인 이더리움의 핵심 기능인 스마트 계약의 보안 취약성을 분석하고, 자동화된 취약성 탐지를 수행하여 대응 전략을 수립하는 프레임워크에 대한 설계 및 구현 솔루션을 제안한다.",
        "Interestingness": 4,
        "Feasibility": 4,
        "Novelty": 4,
        "Novel": true
    },
    {
        "Name": "code_generation_model",
        "Title": "Exploring Code Generation Capabilities of Language Models",
        "Experiment": "Adapt the existing language model to train on a dataset of Python code. Modify the tokenization process to better handle code syntax. Evaluate the model's ability to generate syntactically correct and semantically meaningful code snippets. This involves fine-tuning the existing architecture and potentially adjusting the embedding layers to focus on syntax and semantics of programming languages.",
        "Interestingness": 8,
        "Feasibility": 6,
        "Novelty": 7
    },
    {
        "Name": "multilingual_conversational_model_with_transfer_learning",
        "Title": "Enhancing Multilingual Conversational Models Using Transfer Learning",
        "Experiment": "Adapt the current character-level model to include datasets from multiple languages. Implement a tokenization process sensitive to different scripts and languages. Utilize transfer learning by training the model first on a high-resource language and then fine-tuning it on lower-resource language datasets. Evaluate the model's ability to generate coherent conversational text across different languages using multilingual prompts. This will involve optimizing the embedding layers and training hyperparameters for multilingual capabilities.",
        "Interestingness": 9,
        "Feasibility": 7,
        "Novelty": 8
    },
    {
        "Name": "noise_robustness_in_language_models",
        "Title": "Investigating Noise Robustness in Language Models",
        "Experiment": "Introduce character-level noise (insertions, deletions, substitutions) into training datasets. Modify data loading to manage these variations. Train models on each noisy dataset and evaluate using perplexity and accuracy against a baseline. Integrate data augmentation and adversarial training into the workflow to enhance robustness. Compare results across noise types to identify vulnerabilities, aiming for applications like social media text processing or OCR.",
        "Interestingness": 8,
        "Feasibility": 7,
        "Novelty": 6
    }
]